app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows` FROM `reports`
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `status` = 'menunggu'
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `status` = 'diproses'
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `reports`
LEFT JOIN `users` ON `users`.`id` = `reports`.`user_id`
SELECT `reports`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`
FROM `reports`
LEFT JOIN `users` ON `users`.`id` = `reports`.`user_id`
ORDER BY `reports`.`created_at` DESC
 LIMIT 5
---
    public function reports()
    {
        $status = $this->request->getGet('status') ?: 'all';
        $perPage = 5; // Jumlah item per halaman

        // Query menggunakan model dengan join ke tabel users
        $this->reportModel->select('reports.*, users.name as user_name, users.email as user_email')
                         ->join('users', 'users.id = reports.user_id', 'left');

        // Hitung total laporan per status (sebelum filter status diaplikasikan)
        $totalReports = $this->reportModel->countAll();
        $menungguCount = $this->reportModel->where('status', 'menunggu')->countAllResults();
        $diprosesCount = $this->reportModel->where('status', 'diproses')->countAllResults();
        $selesaiCount = $this->reportModel->where('status', 'selesai')->countAllResults();

        // Reset query builder
        $this->reportModel->resetQuery();

        // Query untuk data yang akan ditampilkan
        $this->reportModel->select('reports.*, users.name as user_name, users.email as user_email')
                         ->join('users', 'users.id = reports.user_id', 'left');

        // Terapkan filter status jika bukan 'all'
        if ($status !== 'all') {
            $this->reportModel->where('reports.status', $status);
        }

        // Urutkan dan paginasi
        $reports = $this->reportModel->orderBy('reports.created_at', 'DESC')
                                   ->paginate($perPage);