app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'eki@gmail.com'
 LIMIT 1
---
    public function loginPost()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();