app/Controllers/ReportController.php

    public function index()
{
    $reportModel = new ReportModel();
    $userId = session()->get('user_id');

    // Ambil laporan terbaru dari user yang login (maksimal 5 laporan terbaru)
    $reports = $reportModel->select('reports.*, users.name as user_name')
                         ->join('users', 'users.id = reports.user_id')
                         ->where('reports.user_id', $userId)
                         ->orderBy('reports.created_at', 'DESC')
                         ->findAll(5);

    // Hitung total laporan per status untuk user yang login
    $totalMenunggu = $reportModel->where('user_id', $userId)
                               ->where('status', 'menunggu')
                               ->countAllResults();
    $totalDiproses = $reportModel->where('user_id', $userId)
                               ->where('status', 'diproses')
                               ->countAllResults();
    $totalSelesai = $reportModel->where('user_id', $userId)
                              ->where('status', 'selesai')
                              ->countAllResults();
---
SELECT `reports`.*, `users`.`name` as `user_name`
FROM `reports`
JOIN `users` ON `users`.`id` = `reports`.`user_id`
WHERE `reports`.`user_id` = '1'
ORDER BY `reports`.`created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `user_id` = '1'
AND `status` = 'menunggu'
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `user_id` = '1'
AND `status` = 'diproses'
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `user_id` = '1'
AND `status` = 'selesai'