app/Controllers/UserController.php

    public function dashboard()
{
    $reportModel = new ReportModel();

    // Ambil semua laporan dari semua user
    $reports = $reportModel->select('reports.*, users.name as user_name')
                         ->join('users', 'users.id = reports.user_id')
                         ->orderBy('reports.created_at', 'DESC')
                         ->findAll();

    // Hitung total laporan per status (semua user)
    $totalMenunggu = $reportModel->where('status', 'menunggu')->countAllResults();
    $totalDiproses = $reportModel->where('status', 'diproses')->countAllResults();
    $totalSelesai = $reportModel->where('status', 'selesai')->countAllResults();
---
SELECT `reports`.*, `users`.`name` as `user_name`
FROM `reports`
JOIN `users` ON `users`.`id` = `reports`.`user_id`
ORDER BY `reports`.`created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `status` = 'menunggu'
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `status` = 'diproses'
SELECT COUNT(*) AS `numrows`
FROM `reports`
WHERE `status` = 'selesai'

    public function profile()
{
    $userId = session()->get('user_id');
    $userModel = new \App\Models\UserModel();
    $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

public function editProfile()
{
    $userId = session()->get('user_id');
    $userModel = new \App\Models\UserModel();
    $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'