app/Models/ReportModel.php

SELECT `reports`.*, `users`.`name` AS `user_name`, `users`.`email` AS `user_email`
FROM `reports`
JOIN `users` ON `users`.`id` = `reports`.`user_id`
WHERE `reports`.`id` = '1'
 LIMIT 1
---
    public function getReportWithUser($id)
    {
        return $this->select('reports.*, users.name AS user_name, users.email AS user_email')
                    ->join('users', 'users.id = reports.user_id')
                    ->where('reports.id', $id)
                    ->first();